'use strict';

import './util/toggle.js';

console.log('Score: 150 / 150 \n',
  '[x] вёрстка валидная (+10) \n',
  '[x] вёрстка семантическая: nav, footer, header, main, section, h1, h2, h3, b, strong (10 * 2 = 20, +20) \n',
  '[x] для оформления СV используются css-стили (+10) \n',
  '[x] контент размещается в блоке, который горизонтально центрируется на странице (+10) \n',
  '[x] вёрстка адаптивная (+10) \n',
  '[x] есть адаптивное бургер-меню. Ссылки в пунктах меню ведут на основные разделы CV. При кликах по пунктам меню реализована плавная прокрутка по якорям. При уменьшении ширины экрана меню становится адаптивным (+10) \n',
  '[x] на странице СV присутствует изображение (+10) \n',
  '[x] контакты для связи и перечень навыков оформлены в виде списка ul > li (+10) \n',
  '[x] CV содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского (+10) \n',
  '[x] CV содержит пример вашего кода (например, решение задачи с сайта codewars) с подсветкой кода (+10) \n',
  '[x] CV содержит изображения-ссылки на выполненные вами проекты. При клике по изображению страница проекта открывается в новой вкладке. У каждого проекта есть название, небольшое описание, указан перечень используемых технологий (+10) \n',
  '[x] CV выполнено на английском языке (+10) \n',
  '[x] выполнены требования к Pull Request (+10) \n',
  '[] есть видеорезюме автора CV на английском языке (+10) \n',
  '[x] дизайн, оформление, качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к задани (+10) \n');
